In [1]:
import numpy as np 
import pandas as pd

In [2]:
df = pd.read_csv('supermarket_sales - Sheet1.csv')
df.head()

,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Payment,gross margin percentage,gross income,Rating
0,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,Ewallet,4.761905,26.1415,9.1
1,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,Cash,4.761905,3.8200,9.6
2,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,Credit card,4.761905,16.2155,7.4
3,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.0480,Ewallet,4.761905,23.2880,8.4
4,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,Ewallet,4.761905,30.2085,5.3

---

 **.apply()** 
- sur une serie
- sur un DataFrame

In [3]:
def square(s):
    return s**2

In [4]:
df['Quantity'].apply(square).head()

0    49
1    25
2    49
3    64
4    49
Name: Quantity, dtype: int64

In [5]:
df['Quantity'].head()

0    7
1    5
2    7
3    8
4    7
Name: Quantity, dtype: int64

In [6]:
df['Quantity'].apply(lambda s: s**2).head()

0    49
1    25
2    49
3    64
4    49
Name: Quantity, dtype: int64

In [7]:
df['Quantity new'] = df['Quantity'].apply(lambda s: s**2)

In [8]:
df[['Quantity','Quantity new']].head()

   Quantity  Quantity new
0         7            49
1         5            25
2         7            49
3         8            64
4         7            49

In [9]:
df[['Quantity','Total']].apply(lambda s: s**2).head()

   Quantity          Total
0        49  301369.707812
1        25    6435.248400
2        49  115957.616150
3        64  239167.946304
4        49  402436.081262

In [10]:
df[['Quantity','Total']].apply(np.mean)

Quantity      5.510000
Total       322.966749
dtype: float64

In [11]:
df[['Quantity','Total']].apply(np.sum)

Quantity      5510.000
Total       322966.749
dtype: float64

---

**.applymap()**
- sur un DataFrame en entier / ensemble de colonnes numeriques formant un DataFrame

In [12]:
df.columns

Index(['City', 'Customer type', 'Gender', 'Product line', 'Unit price',
       'Quantity', 'Tax 5%', 'Total', 'Payment', 'gross margin percentage',
       'gross income', 'Rating', 'Quantity new'],
      dtype='object')

In [13]:
df[['Unit price','Tax 5%','gross margin percentage','gross income']].applymap(np.sqrt).head()

   Unit price    Tax 5%  gross margin percentage  gross income
0    8.642338  5.112876                 2.182179      5.112876
1    3.908964  1.954482                 2.182179      1.954482
2    6.806614  4.026847                 2.182179      4.026847
3    7.630203  4.825764                 2.182179      4.825764
4    9.290318  5.496226                 2.182179      5.496226

In [14]:
type(df[['Unit price','Tax 5%','gross margin percentage','gross income']])

pandas.core.frame.DataFrame

In [15]:
df[['Unit price','Tax 5%','gross margin percentage','gross income']].applymap(float).head()

   Unit price   Tax 5%  gross margin percentage  gross income
0       74.69  26.1415                 4.761905       26.1415
1       15.28   3.8200                 4.761905        3.8200
2       46.33  16.2155                 4.761905       16.2155
3       58.22  23.2880                 4.761905       23.2880
4       86.31  30.2085                 4.761905       30.2085

---

**.map()**
- sur une serie uniquement

In [16]:
df.head()

,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Payment,gross margin percentage,gross income,Rating,Quantity new
0,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,Ewallet,4.761905,26.1415,9.1,49
1,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,Cash,4.761905,3.8200,9.6,25
2,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,Credit card,4.761905,16.2155,7.4,49
3,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.0480,Ewallet,4.761905,23.2880,8.4,64
4,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,Ewallet,4.761905,30.2085,5.3,49

In [17]:
df['Gender'].map({'Female':'F','Male':'M'}).head()

0    F
1    F
2    M
3    M
4    M
Name: Gender, dtype: object

In [18]:
df['Gender'] = df['Gender'].map({'Female':'F','Male':'M'})

In [19]:
df['Gender'].head()

0    F
1    F
2    M
3    M
4    M
Name: Gender, dtype: object

 **Réjoindre la communauté openclass4all** 
 -  https://www.youtube.com/channel/UCE-613S-bsuLukwHDhnRxIA/?sub_confirmation=1

**Vidéo associée à ce notebook** 
 -  https://youtu.be/N7OroZTdFIs

- Profile linkedin  
    - https://www.linkedin.com/in/ousman-hamit-hassani/

- Groupe facebook   
  - https://www.facebook.com/groups/openclass4all/
  
- Page d'entreprise    
  - https://www.linkedin.com/company/openclass4all/
  
- Github
  - **Merci d'ajouter une étoile à mon profil github si vous pensez que le travail que je fais est utile**.
  - https://www.github.com/ousmanhamit/